RIET/src/Enums/Urgencies/Urgencies.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>Urgencies</name>
  <enumValues>
    <name>Standard</name>
  </enumValues>
  <enumValues>
    <name>Urgent</name>
  </enumValues>
  <enumValues>
    <name>Emergency</name>
  </enumValues>
</mdclass:Enum>

RIET/src/Enums/Urgencies/ManagerModule.bsl
Функция ПолучитьПоTMSName(TMSName) Экспорт
	
	Если TMSName = "Low" ИЛИ TMSName = "3" Тогда 
		Возврат Перечисления.Urgencies.Standard;
		
	ИначеЕсли TMSName = "Medium" ИЛИ TMSName = "2" Тогда
		Возврат Перечисления.Urgencies.Urgent;	
		
	ИначеЕсли TMSName = "High" ИЛИ TMSName = "1" Тогда
		Возврат Перечисления.Urgencies.Standard;
		
	Иначе
		Возврат Неопределено;
		
	КонецЕсли;
	
КонецФункции
